In [2]:
import pandas as pd
import numpy as np

In [3]:
raw_data = {'first_name': ['Jason', 'Jason', 'Jason','Tina', 'Jake', 'Amy'], 
        'last_name': ['Miller', 'Miller', 'Miller','Ali', 'Milner', 'Cooze'], 
        'age': [42, 42, 1111111, 36, 24, 73], 
        'preTestScore': [4, 4, 4, 31, 2, 3],
        'postTestScore': [25, 25, 25, 57, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'preTestScore', 'postTestScore'])
df

  first_name last_name      age  preTestScore  postTestScore
0      Jason    Miller       42             4             25
1      Jason    Miller       42             4             25
2      Jason    Miller  1111111             4             25
3       Tina       Ali       36            31             57
4       Jake    Milner       24             2             62
5        Amy     Cooze       73             3             70

In [5]:
df.drop_duplicates(['first_name'], keep = 'last')

  first_name last_name      age  preTestScore  postTestScore
2      Jason    Miller  1111111             4             25
3       Tina       Ali       36            31             57
4       Jake    Milner       24             2             62
5        Amy     Cooze       73             3             70

In [6]:
df.drop_duplicates()

  first_name last_name      age  preTestScore  postTestScore
0      Jason    Miller       42             4             25
2      Jason    Miller  1111111             4             25
3       Tina       Ali       36            31             57
4       Jake    Milner       24             2             62
5        Amy     Cooze       73             3             70

In [7]:
df.describe()

                age  preTestScore  postTestScore
count  6.000000e+00      6.000000       6.000000
mean   1.852213e+05      8.000000      44.000000
std    4.535914e+05     11.296017      21.222629
min    2.400000e+01      2.000000      25.000000
25%    3.750000e+01      3.250000      25.000000
50%    4.200000e+01      4.000000      41.000000
75%    6.525000e+01      4.000000      60.750000
max    1.111111e+06     31.000000      70.000000

In [8]:
df.age.sum()

1111328

In [9]:
df.age.min()

24

In [10]:
df.age.cumsum()

0         42
1         84
2    1111195
3    1111231
4    1111255
5    1111328
Name: age, dtype: int64

In [11]:
df.age.var()

205745202223.86667

In [12]:
df.age.count()

6

In [13]:
df.age.median()

42.0

In [14]:
df.age.mean()

185221.33333333334

In [15]:
df.age.std()

453591.4485788579

In [16]:
df.age.skew()

2.4494897357585432

In [17]:
df.age.kurt()

5.999999973233463

In [18]:
df.corr()

                    age  preTestScore  postTestScore
age            1.000000     -0.173484      -0.438583
preTestScore  -0.173484      1.000000       0.241103
postTestScore -0.438583      0.241103       1.000000

In [19]:
df.cov()

                        age  preTestScore  postTestScore
age            2.057452e+11     -888892.2     -4221981.4
preTestScore  -8.888922e+05         127.6           57.8
postTestScore -4.221981e+06          57.8          450.4

In [22]:
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

             name  year  reports
Cochice     Jason  2012        4
Pima        Molly  2012       24
Santa Cruz   Tina  2013       31
Maricopa     Jake  2014        2
Yuma          Amy  2014        3

In [23]:
df.drop(['Cochice', 'Pima'])

            name  year  reports
Santa Cruz  Tina  2013       31
Maricopa    Jake  2014        2
Yuma         Amy  2014        3

In [24]:
df.drop(['name'], axis = 1)

            year  reports
Cochice     2012        4
Pima        2012       24
Santa Cruz  2013       31
Maricopa    2014        2
Yuma        2014        3

In [25]:
df[df.name != 'Tina']

           name  year  reports
Cochice   Jason  2012        4
Pima      Molly  2012       24
Maricopa   Jake  2014        2
Yuma        Amy  2014        3

In [26]:
df.drop(df.index[2])

           name  year  reports
Cochice   Jason  2012        4
Pima      Molly  2012       24
Maricopa   Jake  2014        2
Yuma        Amy  2014        3

In [27]:
df.drop(df.index[[2,3]])

          name  year  reports
Cochice  Jason  2012        4
Pima     Molly  2012       24
Yuma       Amy  2014        3

In [28]:
df.drop(df.index[-2])

             name  year  reports
Cochice     Jason  2012        4
Pima        Molly  2012       24
Santa Cruz   Tina  2013       31
Yuma          Amy  2014        3

In [29]:
df[:3]

             name  year  reports
Cochice     Jason  2012        4
Pima        Molly  2012       24
Santa Cruz   Tina  2013       31

In [30]:
df[:-3]

          name  year  reports
Cochice  Jason  2012        4
Pima     Molly  2012       24

In [31]:
# Create a list of strings
data = ['One','Two','Three','Four','Five']

In [33]:
for item in enumerate(data):
    print(item)
    
    print(item[1])

(0, 'One')
One
(1, 'Two')
Two
(2, 'Three')
Three
(3, 'Four')
Four
(4, 'Five')
Five

In [34]:
# create a dataset
raw_data = {'score': [1,2,3], 
        'tags': [['apple','pear','guava'],['truck','car','plane'],['cat','dog','mouse']]}
df = pd.DataFrame(raw_data, columns = ['score', 'tags'])

# view the dataset
df

   score                  tags
0      1  [apple, pear, guava]
1      2   [truck, car, plane]
2      3     [cat, dog, mouse]

In [35]:
tags = df['tags'].apply(pd.Series)

In [36]:
tags

       0     1      2
0  apple  pear  guava
1  truck   car  plane
2    cat   dog  mouse

In [40]:
tags.rename(columns = lambda x: 'tag_' + str(x), inplace = True)

In [43]:
df = df.join(tags)

In [44]:
df.drop(['tags'], axis = 1)

   score  tag_0 tag_1  tag_2
0      1  apple  pear  guava
1      2  truck   car  plane
2      3    cat   dog  mouse

In [45]:
df.score.max()

3

In [46]:
df.score.idxmax()

2

In [48]:
df = pd.DataFrame()

df['german_army'] = np.random.randint(low=20000, high=30000, size=100)
df['allied_army'] = np.random.randint(low=20000, high=40000, size=100)
df.index = pd.date_range('1/1/2014', periods=100, freq='H')

df.head()

                     german_army  allied_army
2014-01-01 00:00:00        22031        35735
2014-01-01 01:00:00        21571        35641
2014-01-01 02:00:00        21908        37577
2014-01-01 03:00:00        24448        33575
2014-01-01 04:00:00        26325        32526

In [49]:
df.truncate(before = '1/2/2014', after = '1/3/2014')

                     german_army  allied_army
2014-01-02 00:00:00        28963        39522
2014-01-02 01:00:00        23407        27201
2014-01-02 02:00:00        21348        32980
2014-01-02 03:00:00        23776        32104
2014-01-02 04:00:00        24668        21611
2014-01-02 05:00:00        26962        36363
2014-01-02 06:00:00        27678        30523
2014-01-02 07:00:00        25679        20943
2014-01-02 08:00:00        27206        36822
2014-01-02 09:00:00        21119        39025
2014-01-02 10:00:00        20663        31843
2014-01-02 11:00:00        21529        25279
2014-01-02 12:00:00        26666        21637
2014-01-02 13:00:00        23018        29163
2014-01-02 14:00:00        22060        26117
2014-01-02 15:00:00        20996        30853
2014-01-02 16:00:00        25816        38905
2014-01-02 17:00:00        23665        33815
2014-01-02 18:00:00        24383        31817
2014-01-02 19:00:00        26350        20918
2014-01-02 20:00:00        29481        29178
2014-01-02 21:00:00        27508        20447
2014-01-02 22:00:00        27383        23422
2014-01-02 23:00:00        26767        30376
2014-01-03 00:00:00        26794        38903

In [50]:
# Create dataframe
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['regiment', 'company', 'name', 'preTestScore', 'postTestScore'])
df

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

In [51]:
df.set_index(['regiment', 'company'], inplace = True)

In [52]:
df

                        name  preTestScore  postTestScore
regiment   company
Nighthawks 1st        Miller             4             25
           1st      Jacobson            24             94
           2nd           Ali            31             57
           2nd        Milner             2             62
Dragoons   1st         Cooze             3             70
           1st         Jacon             4             25
           2nd        Ryaner            24             94
           2nd          Sone            31             57
Scouts     1st         Sloan             2             62
           1st         Piger             3             70
           2nd         Riani             2             62
           2nd           Ali             3             70

In [54]:
df.swaplevel('company', 'regiment')

                        name  preTestScore  postTestScore
company regiment
1st     Nighthawks    Miller             4             25
        Nighthawks  Jacobson            24             94
2nd     Nighthawks       Ali            31             57
        Nighthawks    Milner             2             62
1st     Dragoons       Cooze             3             70
        Dragoons       Jacon             4             25
2nd     Dragoons      Ryaner            24             94
        Dragoons        Sone            31             57
1st     Scouts         Sloan             2             62
        Scouts         Piger             3             70
2nd     Scouts         Riani             2             62
        Scouts           Ali             3             70

In [55]:
df.sum(level = 'regiment')

            preTestScore  postTestScore
regiment
Nighthawks            61            238
Dragoons              62            246
Scouts                10            264